Revit 2027 API
SunAndShadowSettings.UsesGroundPlane Property
 Identifies whether the SunAndShadowSettings element uses a ground plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UsesGroundPlane { get; set; }
Public Property UsesGroundPlane As Boolean
	Get
	Set
public:
property bool UsesGroundPlane {
	bool get ();
	void set (bool value);
}
member UsesGroundPlane : bool with get, set
Property Value
Boolean
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace